# WallBaseOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallBaseOffset Property
ParameterTypeId Class See Also
---
"Base Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallBaseOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallBaseOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallBaseOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace